{
  "name": "Joshua Chumbley",
  "github_url": "github.com/jdchum/Resume",
  "role": "Full Stack Developer",
  "languages": [
    "Javascript",
    "Typescript",
    "Go",
    "Python",
    "Rust",
    "C#",
    "SQL",
    "HTML5",
    "CSS3"
  ],
  "technologies": [
    "Node.js",
    "React",
    "Django",
    "React Native",
    "Express.js",
    "Electron",
    "MySQL",
    "SQLite3",
    "PostgreSQL",
    "WPF",
    "UWP",
    "Docker",
    "Digital Ocean",
    "Google Cloud",
    "AWS Lambda",
    ".NET Core",
    ".NET Framework"
  ],
  "experience": [
    {
      "company": "Swagit Productions",
      "description": "Swagit Productions specializes in hands-free video streaming for public education as well as local, state, and federal government meeting bodies.",
      "roles": [
        {
          "title": "Software Engineer",
          "start": "May 2019",
          "end": "Present",
          "duties": [
            "Develop industry leading remote broadcast and streaming systems using Node.js, Go, and .NET backends, React for web and Electron clients, and React Native mobile applications for both iOS and Android",
            "Build on-prem and cloud products used for mission critical applications in governments across the U.S. and Canada",
            "Integrate with third-party RESTful and WebSocket APIs to build spoken language transcription and translation applications using Python and Go"
          ]
        }
      ]
    },
    {
      "company": "FlowTrac",
      "description": "FlowTrac offers best-in-class inventory management services with customizable software solutions for both web and mobile platforms.",
      "roles": [
        {
          "title": "Mobile Application Developer",
          "start": "Feb 2019",
          "end": "Apr 2019",
          "duties": [
            "Designed and implemented internal software libraries for rapid development of data intensive cross-platform mobile applications using React Native for iOS and Android"
          ]
        }
      ]
    },
    {
      "company": "Swagit Productions",
      "description": null,
      "roles": [
        {
          "title": "Research & Development Technician",
          "start": "Jan 2018",
          "end": "Feb 2019",
          "duties": [
            "Designed and launched the Avior™ product line to remotely control robotic cameras and video equipment using Node.js, .NET, and Electron",
            "Reduced the cost of broadcast solutions by building robust integrations with hardware, leading to a marked increase in sales since 2017",
            "Developed real time control applications for cloud, web, on-prem servers, and mobile platforms based on business requirements and end user feedback"
          ]
        },
        {
          "title": "Video Streaming Support Technician",
          "start": "Mar 2016",
          "end": "Jan 2018",
          "duties": [
            "Provided support and maintenance for 500+ remote servers",
            "Developed scripts and applications to streamline product support"
          ]
        }
      ]
    }
  ]
}